PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_canfd.c
/* Defines for default values */
#define CANFD_NBTP_DEF_VAL        (0x06000A03UL)
#define CANFD_DBTP_DEF_VAL        (0x00000A33UL)

/* CANFD MRAM Offset */
#define CY_CANFD_MRAM_START_OFFSET      (0X00010000UL)

/*****************************************************************************
 *  DLC-Word conversion
 *****************************************************************************/
static const uint8_t dataBufferSizeInWord[] =
{
    2u,            /**<  8 bytes */
    3u,            /**< 12 bytes */
    4u,            /**< 16 bytes */
    5u,            /**< 20 bytes */
    6u,            /**< 24 bytes */
    8u,            /**< 32 bytes */
    12u,           /**< 48 bytes */
    16u            /**< 64 bytes */
};


/*****************************************************************************
* Local function prototypes ('static')
*****************************************************************************/

static uint32_t Cy_CANFD_CalcTxBufAdrs(CANFD_Type const *base, uint32_t chan,
                                       uint32_t index,
                                       cy_stc_canfd_context_t const *context);


/*******************************************************************************
* Function Name: Cy_CANFD_Init
****************************************************************************//**
*
* Initializes the CAN FD module.
*
* \note The function does not enable the Tx Event FIFO but reserves 10
* Tx Event FIFO elements in Message RAM.
* \note The function enables the "Message stored to Rx Buffer",
* "Rx FIFO 1 New Message" and "Rx FIFO 0 New Message" interrupt events only.
* Other interrupts can be configured with the Cy_CANFD_SetInterruptMask() function.
* \note If the channel was disabled, call Cy_CANFD_Enable before calling Cy_CANFD_Init.
* \note Call this function only after all debug messages reception is completed.
*
* \param *base
* The pointer to a CAN FD instance.
*
* \param chan
* The CAN FD channel number.
*
* \param *config
* The pointer to the CAN FD configuration structure.
*
* \param *context
* The pointer to the context structure \ref cy_stc_canfd_context_t allocated
* by the user. The structure is used during the CAN FD operation for internal
* configuration and data retention. User must not modify anything in this
* structure.
*
* \return
* \ref cy_en_canfd_status_t
*
* \funcusage
* \snippet canfd/snippet/main.c snippet_Cy_CANFD_Init
*
*******************************************************************************/
cy_en_canfd_status_t Cy_CANFD_Init(CANFD_Type *base, uint32_t chan,
                                   const cy_stc_canfd_config_t *config,
                                   cy_stc_canfd_context_t *context)
{
    cy_en_canfd_status_t ret = CY_CANFD_BAD_PARAM;
    volatile uint32_t *address;
    uint32_t  count;
    uint32_t  sizeInWord;

    /* Check for NULL pointers */
    if ((NULL != base) &&
            (NULL != context) &&
            (NULL != config) &&
            (NULL != config->bitrate) &&
            (NULL != config->globalFilterConfig) &&
            (NULL != config->rxFIFO0Config) &&
            (NULL != config->rxFIFO1Config)
       )
    {
        CY_ASSERT_L2(CY_CANFD_IS_CHANNEL_VALID(chan));
        CY_ASSERT_L2(CY_CANFD_IS_NOM_PRESCALER_VALID(config->bitrate->prescaler));
        CY_ASSERT_L2(CY_CANFD_IS_NOM_TIME_SEG_1_VALID(config->bitrate->timeSegment1));
        CY_ASSERT_L2(CY_CANFD_IS_NOM_TIME_SEG_2_VALID(config->bitrate->timeSegment2));
        CY_ASSERT_L2(CY_CANFD_IS_NOM_SYNC_JUMP_WIDTH_VALID(config->bitrate->syncJumpWidth));

        CY_ASSERT_L2(CY_CANFD_IS_SID_FILTERS_VALID(config->sidFilterConfig->numberOfSIDFilters));
        CY_ASSERT_L2(CY_CANFD_IS_XID_FILTERS_VALID(config->extidFilterConfig->numberOfEXTIDFilters));

        CY_ASSERT_L3(CY_CANFD_IS_ACCEPT_MATCHING_VALID(config->globalFilterConfig->nonMatchingFramesStandard));
        CY_ASSERT_L3(CY_CANFD_IS_ACCEPT_MATCHING_VALID(config->globalFilterConfig->nonMatchingFramesExtended));

        CY_ASSERT_L3(CY_CANFD_IS_BUF_DATA_SIZE_VALID(config->rxBufferDataSize, config->canFDMode));
        CY_ASSERT_L3(CY_CANFD_IS_BUF_DATA_SIZE_VALID(config->rxFIFO1DataSize, config->canFDMode));
        CY_ASSERT_L3(CY_CANFD_IS_BUF_DATA_SIZE_VALID(config->rxFIFO0DataSize, config->canFDMode));
        CY_ASSERT_L3(CY_CANFD_IS_BUF_DATA_SIZE_VALID(config->txBufferDataSize, config->canFDMode));

        CY_ASSERT_L3(CY_CANFD_IS_FIFO_MODE_VALID(config->rxFIFO0Config->mode));
        CY_ASSERT_L3(CY_CANFD_IS_FIFO_MODE_VALID(config->rxFIFO1Config->mode));

        CY_ASSERT_L2(CY_CANFD_IS_FIFO_NUM_VALID(config->rxFIFO0Config->numberOfFIFOElements));
        CY_ASSERT_L2(CY_CANFD_IS_FIFO_NUM_VALID(config->rxFIFO1Config->numberOfFIFOElements));

        CY_ASSERT_L2(CY_CANFD_IS_WATERMARK_VALID(config->rxFIFO1Config->watermark));
        CY_ASSERT_L2(CY_CANFD_IS_WATERMARK_VALID(config->rxFIFO1Config->watermark));

        CY_ASSERT_L2(CY_CANFD_IS_RX_BUF_NUM_VALID(config->noOfRxBuffers));
        CY_ASSERT_L2(CY_CANFD_IS_TX_BUF_NUM_VALID(config->noOfTxBuffers));

        /* Set the notification callback functions */
        context->canFDInterruptHandling.canFDTxInterruptFunction = config->txCallback;
        context->canFDInterruptHandling.canFDRxInterruptFunction = config->rxCallback;
        context->canFDInterruptHandling.canFDErrorInterruptFunction = config->errorCallback;

        /* Set CCCR_INIT and CCCR_CCE bits  */
        ret = Cy_CANFD_ConfigChangesEnable(base, chan);

        if (CY_CANFD_SUCCESS == ret)
        {
            /* Save the message RAM offset and size for the current CAN FD channel */
            context->messageRAMaddress = config->messageRAMaddress;
            context->messageRAMsize = config->messageRAMsize;

            if ((0U   != config->sidFilterConfig->numberOfSIDFilters) &&
                    (NULL != config->sidFilterConfig->sidFilter))
            {
                /* Configure a standard ID filter:
                * The number of SID filters and Start address (word) of the SID filter
                * configuration in Message RAM
                */
                CANFD_SIDFC(base, chan) =
                    _VAL2FLD(CANFD_CH_M_TTCAN_SIDFC_LSS, config->sidFilterConfig->numberOfSIDFilters) |
                    _VAL2FLD(CANFD_CH_M_TTCAN_SIDFC_FLSSA, config->messageRAMaddress >> CY_CANFD_MRAM_SIGNIFICANT_BYTES_SHIFT);
            }
            else
            {
                CANFD_SIDFC(base, chan) = _VAL2FLD(CANFD_CH_M_TTCAN_SIDFC_FLSSA, config->messageRAMaddress >> CY_CANFD_MRAM_SIGNIFICANT_BYTES_SHIFT);
            }

            if ((0U   != config->extidFilterConfig->numberOfEXTIDFilters) &&
                    (NULL != config->extidFilterConfig->extidFilter))
            {
                /* Configure an extended ID filter:
                * The number of XID filters and start address (word) of the ext id
                * filter configuration in Message RAM
                */
                CANFD_XIDFC(base, chan) =
                    _VAL2FLD(CANFD_CH_M_TTCAN_XIDFC_LSE, config->extidFilterConfig->numberOfEXTIDFilters) |
                    _VAL2FLD(CANFD_CH_M_TTCAN_XIDFC_FLESA, _FLD2VAL(CANFD_CH_M_TTCAN_SIDFC_FLSSA, CANFD_SIDFC(base, chan)) +
                             (config->sidFilterConfig->numberOfSIDFilters));

                /* Update the extended ID AND Mask */
                CANFD_XIDAM(base, chan) = _VAL2FLD(CANFD_CH_M_TTCAN_XIDAM_EIDM, config->extidFilterConfig->extIDANDMask);
            }
            else
            {
                CANFD_XIDFC(base, chan) = _VAL2FLD(CANFD_CH_M_TTCAN_XIDFC_FLESA, _FLD2VAL(CANFD_CH_M_TTCAN_SIDFC_FLSSA, CANFD_SIDFC(base, chan)) +
                                                   (config->sidFilterConfig->numberOfSIDFilters));
                CANFD_XIDAM(base, chan) = 0U;
            }

            /* Configuration of Rx Buffer and Rx FIFO */
            CANFD_RXESC(base, chan) =
                _VAL2FLD(CANFD_CH_M_TTCAN_RXESC_RBDS, config->rxBufferDataSize) | /* Rx Buffer Data Size */
                _VAL2FLD(CANFD_CH_M_TTCAN_RXESC_F1DS, config->rxFIFO1DataSize) | /* Rx FIFO 1 Data Size */
                _VAL2FLD(CANFD_CH_M_TTCAN_RXESC_F0DS, config->rxFIFO0DataSize);  /* Rx FIFO 0 Data Size */

            /* Set the Rx FIFO 0 configuration:
             *  CAN FD RX FIFO 0 operating mode
             *  RX FIFO 0 Watermark
             *  The number of RX FIFO 0 Elements
             *  The start address of Rx FIFO 0 in Message RAM
             */
            CANFD_RXF0C(base, chan) =
                _VAL2FLD(CANFD_CH_M_TTCAN_RXF0C_F0OM, config->rxFIFO0Config->mode) |
                _VAL2FLD(CANFD_CH_M_TTCAN_RXF0C_F0WM, config->rxFIFO0Config->watermark) |
                _VAL2FLD(CANFD_CH_M_TTCAN_RXF0C_F0S, config->rxFIFO0Config->numberOfFIFOElements) |
                _VAL2FLD(CANFD_CH_M_TTCAN_RXF0C_F0SA, _FLD2VAL(CANFD_CH_M_TTCAN_XIDFC_FLESA, CANFD_XIDFC(base, chan)) +
                         (config->extidFilterConfig->numberOfEXTIDFilters *
                          CY_CANFD_SIZE_OF_EXTID_FILTER_IN_WORD));

            /* Set the Rx FIFO 1 configuration:
             *  CAN FD RX FIFO  1 operating mode
             *  RX FIFO 1 Watermark
             *  The number of RX FIFO 1 Elements
             *  The start address of Rx FIFO 1 in Message RAM
            */
            CANFD_RXF1C(base, chan) =
                _VAL2FLD(CANFD_CH_M_TTCAN_RXF1C_F1OM, config->rxFIFO1Config->mode) |
                _VAL2FLD(CANFD_CH_M_TTCAN_RXF1C_F1WM, config->rxFIFO1Config->watermark) |
                _VAL2FLD(CANFD_CH_M_TTCAN_RXF1C_F1S, config->rxFIFO1Config->numberOfFIFOElements) |
                _VAL2FLD(CANFD_CH_M_TTCAN_RXF1C_F1SA,
                         _FLD2VAL(CANFD_CH_M_TTCAN_RXF0C_F0SA, CANFD_RXF0C(base, chan)) +
                         (config->rxFIFO0Config->numberOfFIFOElements *
                          (CY_CANFD_R0_R1_SIZE + dataBufferSizeInWord[config->rxFIFO0DataSize])));

