PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_canfd.c
            /* Configure the Rx FIFO 0,1 Top pointer logic configuration */
            CANFD_RXFTOP_CTL(base, chan) =
                _VAL2FLD(CANFD_CH_RXFTOP_CTL_F0TPE, (config->rxFIFO0Config->topPointerLogicEnabled) ? 1UL : 0UL) |
                _VAL2FLD(CANFD_CH_RXFTOP_CTL_F1TPE, (config->rxFIFO1Config->topPointerLogicEnabled) ? 1UL : 0UL);

            /* Set the start address of the Rx buffer in Message RAM */
            CANFD_RXBC(base, chan) =
                _VAL2FLD(CANFD_CH_M_TTCAN_RXBC_RBSA, _FLD2VAL(CANFD_CH_M_TTCAN_RXF1C_F1SA, CANFD_RXF1C(base, chan)) +
                         (config->rxFIFO1Config->numberOfFIFOElements *
                          (CY_CANFD_R0_R1_SIZE + dataBufferSizeInWord[config->rxFIFO1DataSize])));

            /* Configure Tx Buffer and Tx FIFO/Queue */
            CANFD_TXESC(base, chan) = _VAL2FLD(CANFD_CH_M_TTCAN_TXESC_TBDS, config->txBufferDataSize);

            /* Set Tx FIFO/QUEUE (not used):
             *  The Watermark interrupt disabled
             *  Tx Event FIFO disabled
             *  The start address of Tx Event FIFO in Message RAM
            */
            CANFD_TXEFC(base, chan) =
                _VAL2FLD(CANFD_CH_M_TTCAN_TXEFC_EFWM, 0UL) |
                _VAL2FLD(CANFD_CH_M_TTCAN_TXEFC_EFS, 0UL)  |
                _VAL2FLD(CANFD_CH_M_TTCAN_TXEFC_EFSA, _FLD2VAL(CANFD_CH_M_TTCAN_RXBC_RBSA, CANFD_RXBC(base, chan)) +
                         (config->noOfRxBuffers * (CY_CANFD_R0_R1_SIZE +
                                                   dataBufferSizeInWord[config->rxBufferDataSize])));

            /* Update Tx buffer configuration:
             *  The Tx FIFO operation
             *  No Tx FIFO/Queue
             *  The number of Dedicated Tx Buffers
             *  Reserve memory for 10 Tx Event FIFO elements for easy use in future
             */
            CANFD_TXBC(base, chan) =
                _VAL2FLD(CANFD_CH_M_TTCAN_TXBC_TFQM, 0UL) |
                _VAL2FLD(CANFD_CH_M_TTCAN_TXBC_TFQS, 0UL) |
                _VAL2FLD(CANFD_CH_M_TTCAN_TXBC_NDTB, config->noOfTxBuffers) |
                _VAL2FLD(CANFD_CH_M_TTCAN_TXBC_TBSA, _FLD2VAL(CANFD_CH_M_TTCAN_TXEFC_EFSA, CANFD_TXEFC(base, chan)) +
                         (CY_CANFD_TX_EVENT_FIFO_ELEMENTS_NUM *
                          CY_CANFD_SIZE_OF_TXEVENT_FIFO_IN_WORD));

            /* Initialize the Message RAM area (Entire region zeroing) for channel */
            address = (volatile uint32_t *)(config->messageRAMaddress);
            sizeInWord = config->messageRAMsize >> CY_CANFD_MRAM_SIGNIFICANT_BYTES_SHIFT;
            for (count = 0UL; count < sizeInWord; count++)
            {
                address[count] = 0UL;
            }

            /* The configuration of the CAN bus */

            /* CCCR register */
            CANFD_CCCR(base, chan) = _VAL2FLD(CANFD_CH_M_TTCAN_CCCR_INIT, 1UL) | /* Keep in initialization state */
                                     _VAL2FLD(CANFD_CH_M_TTCAN_CCCR_CCE, 1UL)  | /* Keep CCE to enabled */
                                     _VAL2FLD(CANFD_CH_M_TTCAN_CCCR_TXP, 0UL)  | /* Transmit pause disabled */
                                     _VAL2FLD(CANFD_CH_M_TTCAN_CCCR_BRSE, ((config->canFDMode) ? 1UL : 0UL)) | /* Bit rate */
                                     _VAL2FLD(CANFD_CH_M_TTCAN_CCCR_FDOE, ((config->canFDMode) ? 1UL : 0UL)) | /* FD mode */
                                     _VAL2FLD(CANFD_CH_M_TTCAN_CCCR_TEST, 0UL) | /* Normal operation */
                                     _VAL2FLD(CANFD_CH_M_TTCAN_CCCR_DAR, 0UL)  | /* Automatic retransmission enabled */
                                     _VAL2FLD(CANFD_CH_M_TTCAN_CCCR_MON_, 0UL) | /* Bus Monitoring Mode is disabled */
                                     _VAL2FLD(CANFD_CH_M_TTCAN_CCCR_CSR, 0UL)  | /* No clock stop is requested */
                                     _VAL2FLD(CANFD_CH_M_TTCAN_CCCR_ASM, 0UL);   /* Normal CAN operation */

            /* The nominal bit timing & prescaler register */
            Cy_CANFD_SetBitrate(base, chan, config->bitrate);

            if (config->canFDMode)
            {
                if (NULL != config->fastBitrate)
                {
                    CY_ASSERT_L2(CY_CANFD_IS_DAT_PRESCALER_VALID(config->fastBitrate->prescaler));
                    CY_ASSERT_L2(CY_CANFD_IS_DAT_TIME_SEG_1_VALID(config->fastBitrate->timeSegment1));
                    CY_ASSERT_L2(CY_CANFD_IS_DAT_TIME_SEG_2_VALID(config->fastBitrate->timeSegment2));
                    CY_ASSERT_L2(CY_CANFD_IS_DAT_SYNC_JUMP_WIDTH_VALID(config->fastBitrate->syncJumpWidth));

                    /* Set data bit timing & prescaler */
                    Cy_CANFD_SetFastBitrate(base, chan, config->fastBitrate);
                }
                else
                {
                    ret = CY_CANFD_BAD_PARAM;
                }

                if ((NULL != config->tdcConfig) && (ret != CY_CANFD_BAD_PARAM))
                {
                    CY_ASSERT_L2(CY_CANFD_IS_TDCO_VALID(config->tdcConfig->tdcOffset));
                    CY_ASSERT_L2(CY_CANFD_IS_TDCF_VALID(config->tdcConfig->tdcFilterWindow));

                    /* Transmitter delay compensation */
                    Cy_CANFD_SetTDC(base, chan, config->tdcConfig);
                }
                else
                {
                    ret = CY_CANFD_BAD_PARAM;
                }
            }

            if (ret != CY_CANFD_BAD_PARAM)
            {
                /* The configuration of a global filter */
                CANFD_GFC(base, chan) =
                    _VAL2FLD(CANFD_CH_M_TTCAN_GFC_ANFS, config->globalFilterConfig->nonMatchingFramesStandard) |
                    _VAL2FLD(CANFD_CH_M_TTCAN_GFC_ANFE, config->globalFilterConfig->nonMatchingFramesExtended) |
                    _VAL2FLD(CANFD_CH_M_TTCAN_GFC_RRFS, ((config->globalFilterConfig->rejectRemoteFramesStandard) ? 1UL : 0UL)) |
                    _VAL2FLD(CANFD_CH_M_TTCAN_GFC_RRFE, ((config->globalFilterConfig->rejectRemoteFramesExtended) ? 1UL : 0UL));

                if (0U != config->sidFilterConfig->numberOfSIDFilters)
                {
                    /* Standard Message ID filters */
                    Cy_CANFD_SidFiltersSetup(base, chan, config->sidFilterConfig, context);
                }

