PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_canfd.c
/*******************************************************************************
* Function Name: Cy_CANFD_CalcRxBufAdrs
****************************************************************************//**
*
*  Calculates the address of the RX buffer element.
*
* \param *base
* The pointer to a CAN FD instance.
*
* \param chan
* The CAN FD channel number.
*
* \param index
* The message buffer index for reception (0-63).
*
* \param context
* The pointer to the context structure \ref cy_stc_canfd_context_t allocated
* by the user. The structure is used during the CAN FD operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* The message buffer address corresponding to the index. Can be 0 if the index
* is invalid.
*
* \funcusage
* \snippet canfd/snippet/main.c snippet_Cy_CANFD_GetRxBuffer
*
*******************************************************************************/
uint32_t  Cy_CANFD_CalcRxBufAdrs(CANFD_Type const *base, uint32_t chan,
                                 uint32_t index,
                                 cy_stc_canfd_context_t const *context)
{
    uint32_t address;

    (void)context;

    if (index > (CY_CANFD_MESSAGE_RX_BUFFERS_MAX_CNT - 1UL))
    {
        /* Sets 0 to the return value if the index is invalid */
        address = 0UL;
    }
    else
    {
        /* Sets the message buffer address to the return value if the index is available  */
        address = (uint32_t)base + CY_CANFD_MRAM_START_OFFSET;
        address += (_FLD2VAL(CANFD_CH_M_TTCAN_RXBC_RBSA, CANFD_RXBC(base, chan))
                    * sizeof(uint32_t));  /* Convert the word to the byte offset */
        address += index * (CY_CANFD_R0_R1_SIZE +
                            dataBufferSizeInWord[_FLD2VAL(CANFD_CH_M_TTCAN_RXESC_RBDS, CANFD_RXESC(base, chan))]) *
                   sizeof(uint32_t);   /* Convert the word to the byte offset */
    }
    return address;
}


/*******************************************************************************
* Function Name: Cy_CANFD_CalcTxBufAdrs
****************************************************************************//**
*
*  Calculates the address of the TX buffer element.
*
* \param *base
* The pointer to a CAN FD instance.
*
* \param chan
* The CAN FD channel number.
*
* \param index
* The Message buffer index for the transmission (0-31).
*
* \param context
* The pointer to the context structure \ref cy_stc_canfd_context_t allocated
* by the user. The structure is used during the CAN FD operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* The Message buffer address corresponding to the index.
* Can be 0 if the index is invalid.
*
*******************************************************************************/
static uint32_t Cy_CANFD_CalcTxBufAdrs(CANFD_Type const *base, uint32_t chan, uint32_t index, cy_stc_canfd_context_t const *context)
{
    uint32_t address = 0UL;

    (void)context;

    /* Set the message buffer address to the return value if the index is available */
    address = (uint32_t)base + CY_CANFD_MRAM_START_OFFSET;
    address += (_FLD2VAL(CANFD_CH_M_TTCAN_TXBC_TBSA, CANFD_TXBC(base, chan))  /* Tx 32-bit Start Address */
                * sizeof(uint32_t));  /* Convert the word to the byte offset */

    if (index < (CY_CANFD_MESSAGE_TX_BUFFERS_MAX_CNT))
    {
        address += index * (CY_CANFD_T0_T1_SIZE +
                            dataBufferSizeInWord[_FLD2VAL(CANFD_CH_M_TTCAN_TXESC_TBDS, CANFD_TXESC(base, chan))]) *
                   sizeof(uint32_t);   /* Converts the word to the byte offset */
    }
    else
    {
        address = 0UL;
    }

    return address;
}


/*******************************************************************************
* Function Name: Cy_CANFD_CalcRxFifoAdrs
****************************************************************************//**
*
*  Calculates the address of the RX FIFO element.
*
* \param *base
* The pointer to a CAN FD instance.
*
* \param chan
* The CAN FD channel number.
*
* \param fifoNumber
* The FIFO number (0 or 1).
*
* \param index
* The Message buffer index for the reception (0-63).
*
* \param context
* The pointer to the context structure \ref cy_stc_canfd_context_t allocated
* by the user. The structure is used during the CAN FD operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* The Message buffer address corresponding to the index.
* Can be 0 if the index is invalid.
*
* \funcusage
* \snippet canfd/snippet/main.c snippet_Cy_CANFD_GetRxBuffer
*
*******************************************************************************/
uint32_t Cy_CANFD_CalcRxFifoAdrs(CANFD_Type const *base, uint32_t chan,
                                 uint32_t fifoNumber,
                                 uint32_t index,
                                 cy_stc_canfd_context_t const *context)
{
    uint32_t address = 0UL;

    (void)context;

    CY_ASSERT_L2(CY_CANFD_IS_FIFO_NUM_VALID(index));
    if (fifoNumber <= CY_CANFD_RX_FIFO1)
    {
        /* Sets the message buffer address to the return value if the index is available */
        address = (uint32_t)base + CY_CANFD_MRAM_START_OFFSET;
        address += (((CY_CANFD_RX_FIFO0 == fifoNumber) ?
                     _FLD2VAL(CANFD_CH_M_TTCAN_RXF0C_F0SA, CANFD_RXF0C(base, chan)) :  /* Rx FIFO 0 32-bit Start Address */
                     _FLD2VAL(CANFD_CH_M_TTCAN_RXF1C_F1SA, CANFD_RXF1C(base, chan)))   /* Rx FIFO 1 32-bit Start Address */
                    * sizeof(uint32_t));  /* Convert the word to the byte offset */
        address += index * (CY_CANFD_R0_R1_SIZE +
                            dataBufferSizeInWord[(CY_CANFD_RX_FIFO0 == fifoNumber) ?
                                _FLD2VAL(CANFD_CH_M_TTCAN_RXESC_F0DS, CANFD_RXESC(base, chan)) :
                                _FLD2VAL(CANFD_CH_M_TTCAN_RXESC_F1DS, CANFD_RXESC(base, chan))]) *
                   sizeof(uint32_t);   /* Converts the word to the byte offset */
    }

    return address;
}


