PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_canfd.c
/*******************************************************************************
* Function Name: Cy_CANFD_SidFilterSetup
****************************************************************************//**
*
* Updates the Standard Message ID Filter Element configuration in Message RAM.
*
* \param *base
* The pointer to a CAN FD instance.
*
* \param chan
* The CAN FD channel number.
*
* \param *filter
*  The SID Filter register element structure.
*
* \param index
*  The SID filter index.
*
* \param *context
* The pointer to the context structure \ref cy_stc_canfd_context_t allocated
* by the user. The structure is used during the CAN FD operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \funcusage
* \snippet canfd/snippet/main.c snippet_Cy_CANFD_SidFilterSetup
*
*******************************************************************************/
void Cy_CANFD_SidFilterSetup(CANFD_Type const *base, uint32_t chan,
                             const cy_stc_id_filter_t *filter,
                             uint32_t index,
                             cy_stc_canfd_context_t const *context)
{
    uint32_t *filterAddr;

    (void)context;

    if ((NULL != filter) && (NULL != context))
    {
        CY_ASSERT_L2(CY_CANFD_IS_SFID_VALID(filter->sfid2));
        CY_ASSERT_L2(CY_CANFD_IS_SFID_VALID(filter->sfid1));
        CY_ASSERT_L3(CY_CANFD_IS_SFEC_VALID(filter->sfec));
        CY_ASSERT_L3(CY_CANFD_IS_SFT_VALID(filter->sft));
        CY_ASSERT_L2(CY_CANFD_IS_SID_FILTERS_VALID(index + 1U));

        /* The Standard Message ID Filter address */
        filterAddr = (uint32_t *)((uint32_t)base + CY_CANFD_MRAM_START_OFFSET +
                                  (_FLD2VAL(CANFD_CH_M_TTCAN_SIDFC_FLSSA, CANFD_SIDFC(base, chan))
                                   << CY_CANFD_MRAM_SIGNIFICANT_BYTES_SHIFT));

        /* The Standard Message ID Filter element address */
        filterAddr += index;

        /* Configuration of Rx Buffer and Rx FIFO */
        *filterAddr = _VAL2FLD(CY_CANFD_SID_FILTER_S0_SFID2, filter->sfid2) | /* Standard Filter ID 2 */
                      _VAL2FLD(CY_CANFD_SID_FILTER_S0_SFID1, filter->sfid1) | /* Standard Filter ID 1 */
                      _VAL2FLD(CY_CANFD_SID_FILTER_S0_SFEC, filter->sfec)  |  /* Standard Filter Element Configuration*/
                      _VAL2FLD(CY_CANFD_SID_FILTER_S0_SFT, filter->sft);      /* Standard Filter Type */
    }
}


/*******************************************************************************
* Function Name: Cy_CANFD_SidFiltersSetup
****************************************************************************//**
*
*  Updates the Standard Message ID Filters configuration in Message RAM.
*
* \param *base
* The pointer to a CAN FD instance.
*
* \param chan
*  The CAN FD channel number.
*
* \param filterConfig
*  The Standard ID filter configuration structure.
*
* \param context
* The pointer to the context structure \ref cy_stc_canfd_context_t allocated
* by the user. The structure is used during the CAN FD operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
*******************************************************************************/
void Cy_CANFD_SidFiltersSetup(CANFD_Type const *base, uint32_t chan,
                              const cy_stc_canfd_sid_filter_config_t *filterConfig,
                              cy_stc_canfd_context_t const *context)
{
    uint32_t index;

    if ((NULL != filterConfig) && (NULL != context))
    {
        CY_ASSERT_L2(CY_CANFD_IS_SID_FILTERS_VALID(filterConfig->numberOfSIDFilters));

        for (index = 0UL; index < filterConfig->numberOfSIDFilters; index++)
        {
            Cy_CANFD_SidFilterSetup(base, chan, (filterConfig->sidFilter + index), index, context);
        }
    }
}


/*******************************************************************************
* Function Name: Cy_CANFD_XidFilterSetup
****************************************************************************//**
*
*  Updates the Extended Message ID Filter Element configuration in Message RAM.
*
* \param *base
* The pointer to a CAN FD instance.
*
* \param chan
* The CAN FD channel number.
*
* \param filter
* The XID Filter register element structure.
*
* \param index
*     The XID filter index.
*
* \param context
* The pointer to the context structure \ref cy_stc_canfd_context_t allocated
* by the user. The structure is used during the CAN FD operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \funcusage
* \snippet canfd/snippet/main.c snippet_Cy_CANFD_XidFilterSetup
*
*******************************************************************************/
void Cy_CANFD_XidFilterSetup(CANFD_Type const *base, uint32_t chan,
                             const cy_stc_extid_filter_t *filter,
                             uint32_t index,
                             cy_stc_canfd_context_t const *context)
{
    uint32_t *filterAddr;

    (void)context;

    if ((NULL != filter) && (NULL != context))
    {
        CY_ASSERT_L2(CY_CANFD_IS_EFID_VALID(filter->f1_f->efid2));
        CY_ASSERT_L2(CY_CANFD_IS_EFID_VALID(filter->f0_f->efid1));
        CY_ASSERT_L3(CY_CANFD_IS_EFEC_VALID(filter->f0_f->efec));
        CY_ASSERT_L3(CY_CANFD_IS_EFT_VALID(filter->f1_f->eft));
        CY_ASSERT_L2(CY_CANFD_IS_XID_FILTERS_VALID(index + 1U));

        /* The Extended Message ID Filter address */
        filterAddr = (uint32_t *)((uint32_t)base + CY_CANFD_MRAM_START_OFFSET +
                                  (_FLD2VAL(CANFD_CH_M_TTCAN_XIDFC_FLESA, CANFD_XIDFC(base, chan))
                                   << CY_CANFD_MRAM_SIGNIFICANT_BYTES_SHIFT));

        /* The Extended Message ID Filter element address */
        filterAddr += (index << 1U);  /* The shift to 1 defines F0 and F1 fields */

        /* Configuration of F0 for the Rx Buffer and Rx FIFO filter element */
        *filterAddr = _VAL2FLD(CY_CANFD_XID_FILTER_F0_EFID1, filter->f0_f->efid1) | /* XID Filter ID 1 */
                      _VAL2FLD(CY_CANFD_XID_FILTER_F0_EFEC, filter->f0_f->efec); /* XID Filter Element Configuration */

