PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_canfd.c
        /* Increment the address to get the address for F1 */
        filterAddr++;

        /* Configuration of F1 for the Rx Buffer and Rx FIFO filter element */
        *filterAddr = _VAL2FLD(CY_CANFD_XID_FILTER_F1_EFID2, filter->f1_f->efid2) | /* XID Filter ID 2 */
                      _VAL2FLD(CY_CANFD_XID_FILTER_F1_ETF, filter->f1_f->eft);     /* XID Filter Type */
    }
}


/*******************************************************************************
* Function Name: Cy_CANFD_XidFiltersSetup
****************************************************************************//**
*
*  Updates the Extended Message ID Filters configuration in Message RAM.
*
* \param *base
* The pointer to a CAN FD instance.
*
* \param chan
* The CAN FD channel number.
*
* \param filterConfig
* The Extended ID filter configuration structure.
*
* \param context
* The pointer to the context structure \ref cy_stc_canfd_context_t allocated
* by the user. The structure is used during the CAN FD operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
*******************************************************************************/
void Cy_CANFD_XidFiltersSetup(CANFD_Type const *base, uint32_t chan,
                              const cy_stc_canfd_extid_filter_config_t *filterConfig,
                              cy_stc_canfd_context_t const *context)
{
    uint32_t index;

    if ((NULL != filterConfig) && (NULL != context))
    {
        CY_ASSERT_L2(CY_CANFD_IS_XID_FILTERS_VALID(filterConfig->numberOfEXTIDFilters));

        for (index = 0UL; index < filterConfig->numberOfEXTIDFilters; index++)
        {
            Cy_CANFD_XidFilterSetup(base, chan, (filterConfig->extidFilter + index), index, context);
        }
    }
}


/*******************************************************************************
* Function Name: Cy_CANFD_GetRxBuffer
****************************************************************************//**
*
* Extracts the RX Buffer from Message RAM.
*
* \note Remember to clear the NDAT register bits after the RX buffer is read.
* \note Remember to acknowledge the FIFO buffer after reading one FIFO element.
*
* \param *base
* The pointer to a CAN FD instance.
*
* \param chan
* The CAN FD channel number.
*
* \param bufferAddress
*  The Rx, FIFO 0 or FIFO 1 Buffer element address in CAN Message RAM.
*
* \param *rxBuffer
*  The Rx Buffer structure in RAM.
*
* \return
* \ref cy_en_canfd_status_t
*
* \funcusage
* \snippet canfd/snippet/main.c snippet_Cy_CANFD_GetRxBuffer
*
*******************************************************************************/
cy_en_canfd_status_t Cy_CANFD_GetRxBuffer(CANFD_Type const *base, uint32_t chan,
        const uint32_t bufferAddress,
        cy_stc_canfd_rx_buffer_t const *rxBuffer)
{
    cy_en_canfd_status_t ret = CY_CANFD_BAD_PARAM;
    volatile const uint32_t *address = (uint32_t*)bufferAddress;
    uint32_t count    = 0UL;
    uint32_t dlcIndex = 0UL;

    (void)base; /* Suppress warning */
    (void)chan; /* Suppress warning */

    /* Checks for the NULL pointers */
    if (NULL != rxBuffer)
    {
        if ((NULL != rxBuffer->r0_f) && (NULL != rxBuffer->r1_f) &&
                (NULL != rxBuffer->data_area_f))
        {
            rxBuffer->r0_f->id = _FLD2VAL(CY_CANFD_RX_BUFFER_R0_ID, *address);
            rxBuffer->r0_f->rtr = (cy_en_canfd_rtr_t)((uint32_t)_FLD2VAL(CY_CANFD_RX_BUFFER_R0_RTR, *address));
            rxBuffer->r0_f->xtd = (cy_en_canfd_xtd_t)((uint32_t)_FLD2VAL(CY_CANFD_RX_BUFFER_R0_XTD, *address));
            rxBuffer->r0_f->esi = (cy_en_canfd_esi_t)((uint32_t)_FLD2VAL(CY_CANFD_RX_BUFFER_R0_ESI, *address));

            address++;
            rxBuffer->r1_f->rxts = _FLD2VAL(CY_CANFD_RX_BUFFER_R1_RXTS, *address);
            rxBuffer->r1_f->dlc = _FLD2VAL(CY_CANFD_RX_BUFFER_R1_DLC, *address);
            rxBuffer->r1_f->brs = _FLD2BOOL(CY_CANFD_RX_BUFFER_R1_BRS, *address);
            rxBuffer->r1_f->fdf = (cy_en_canfd_fdf_t)((uint32_t)_FLD2VAL(CY_CANFD_RX_BUFFER_R1_FDF, *address));
            rxBuffer->r1_f->fidx = _FLD2VAL(CY_CANFD_RX_BUFFER_R1_FIDX, *address);
            rxBuffer->r1_f->anmf = (cy_en_canfd_anmf_t)((uint32_t)_FLD2VAL(CY_CANFD_RX_BUFFER_R1_ANMF, *address));

            /* ID : Shifts a standard RxID to its position */
            if (rxBuffer->r0_f->xtd == CY_CANFD_XTD_STANDARD_ID)
            {
                rxBuffer->r0_f->id >>= CY_CANFD_EXT_IDENTIFIER_LENGTH;
            }

            /* Copies the 0-64 byte of the data area */
            if (rxBuffer->r1_f->dlc > CY_CANFD_CLASSIC_CAN_DATA_LENGTH)
            {
                dlcIndex = (uint32_t)(rxBuffer->r1_f->dlc - CY_CANFD_CLASSIC_CAN_DATA_LENGTH);
            }

            for (count = 0UL; count < (uint32_t)dataBufferSizeInWord[dlcIndex]; count++)
            {
                address++;
                rxBuffer->data_area_f[count] = *address;
            }

            ret = CY_CANFD_SUCCESS;
        }
    }

    return ret;
}


/*******************************************************************************
* Function Name: Cy_CANFD_GetFIFOTop
****************************************************************************//**
*
* Extracts one RX FIFO Buffer element using the FIFO TOP register logic.
*
* \param *base
* The pointer to a CAN FD instance.
*
* \param chan
* The CAN FD channel number.
*
* \param FIFONumber
*  The CY_CANFD_RX_FIFO0 or CY_CANFD_RX_FIFO1, FIFO Buffer number.
*
* \param *rxBuffer
*  The Rx Buffer structure in RAM.
*
* \return
* \ref cy_en_canfd_status_t
*
* \funcusage
* \snippet canfd/snippet/main.c snippet_Cy_CANFD_GetFIFOTop
*
*******************************************************************************/
cy_en_canfd_status_t Cy_CANFD_GetFIFOTop(CANFD_Type const *base, uint32_t chan,
        const uint8_t FIFONumber,
        cy_stc_canfd_rx_buffer_t const *rxBuffer)
{
    cy_en_canfd_status_t ret = CY_CANFD_BAD_PARAM;
    volatile const uint32_t *address;
    uint32_t count    = 0UL;
    uint32_t dataSize = 0UL;
    uint32_t tmpregister = 0UL;

    /* Checks for the NULL pointers */
    if (NULL != rxBuffer)
    {
        if ((NULL != rxBuffer->r0_f) && (NULL != rxBuffer->r1_f) &&
                (NULL != rxBuffer->data_area_f))
        {
            /* Selects a corresponding FIFO TOP address and FIFO element size */
            if (CY_CANFD_RX_FIFO0 == FIFONumber)
            {
                address = (uint32_t*)&CANFD_RXFTOP0_DATA(base, chan);
                dataSize = (uint32_t)dataBufferSizeInWord[_FLD2VAL(CANFD_CH_M_TTCAN_RXESC_F0DS,
                           CANFD_RXESC(base, chan))];
            }
            else
            {
                address = (uint32_t*)&CANFD_RXFTOP1_DATA(base, chan);
                dataSize = (uint32_t)dataBufferSizeInWord[_FLD2VAL(CANFD_CH_M_TTCAN_RXESC_F1DS,
                           CANFD_RXESC(base, chan))];
            }

