PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_canfd.c
            tmpregister = *address; /* The FIFO Read pointer is post-incremented by the HW */
            rxBuffer->r0_f->id = _FLD2VAL(CY_CANFD_RX_BUFFER_R0_ID, tmpregister);
            rxBuffer->r0_f->rtr = (cy_en_canfd_rtr_t)((uint32_t)_FLD2VAL(CY_CANFD_RX_BUFFER_R0_RTR, tmpregister));
            rxBuffer->r0_f->xtd = (cy_en_canfd_xtd_t)((uint32_t)_FLD2VAL(CY_CANFD_RX_BUFFER_R0_XTD, tmpregister));
            rxBuffer->r0_f->esi = (cy_en_canfd_esi_t)((uint32_t)_FLD2VAL(CY_CANFD_RX_BUFFER_R0_ESI, tmpregister));

            tmpregister = *address; /* The FIFO Read pointer is post-incremented by the HW */
            rxBuffer->r1_f->rxts = _FLD2VAL(CY_CANFD_RX_BUFFER_R1_RXTS, tmpregister);
            rxBuffer->r1_f->dlc = _FLD2VAL(CY_CANFD_RX_BUFFER_R1_DLC, tmpregister);
            rxBuffer->r1_f->brs = _FLD2BOOL(CY_CANFD_RX_BUFFER_R1_BRS, tmpregister);
            rxBuffer->r1_f->fdf = (cy_en_canfd_fdf_t)((uint32_t)_FLD2VAL(CY_CANFD_RX_BUFFER_R1_FDF, tmpregister));
            rxBuffer->r1_f->fidx = _FLD2VAL(CY_CANFD_RX_BUFFER_R1_FIDX, tmpregister);
            rxBuffer->r1_f->anmf = (cy_en_canfd_anmf_t)((uint32_t)_FLD2VAL(CY_CANFD_RX_BUFFER_R1_ANMF, tmpregister));

            /* ID : Shifts a standard RxID to its position */
            if (rxBuffer->r0_f->xtd == CY_CANFD_XTD_STANDARD_ID)
            {
                rxBuffer->r0_f->id >>= CY_CANFD_EXT_IDENTIFIER_LENGTH;
            }

            /* Copies the whole data area of one FIFO element */
            for (count = 0UL; count < dataSize; count++)
            {
                rxBuffer->data_area_f[count] = *address; /* The FIFO read pointer is post-incremented by the HW */
            }

            ret = CY_CANFD_SUCCESS;
        }
    }

    return ret;
}


/*******************************************************************************
* Function Name: Cy_CANFD_ExtractMsgFromRXBuffer
****************************************************************************//**
*
* Extracts one RX buffer or one FIFO buffer element.
*
* \param *base
* The pointer to a CAN FD instance.
*
* \param chan
* The CAN FD channel number.
*
* \param rxFIFOMsg
*  The buffer to read: True for FIFO buffers and False for RX buffers.
*
* \param msgBufOrRxFIFONum
*  The RX buffer element index or FIFO buffer number.
*
* \param *rxBuffer
*  The Rx buffer structure in RAM.
*
* \param context
* The pointer to the context structure \ref cy_stc_canfd_context_t allocated
* by the user. The structure is used during the CAN FD operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* \ref cy_en_canfd_status_t
*
* \funcusage
* \snippet canfd/snippet/main.c snippet_Cy_CANFD_ExtractMsgFromRXBuffer
*
*******************************************************************************/
cy_en_canfd_status_t Cy_CANFD_ExtractMsgFromRXBuffer(CANFD_Type *base, uint32_t chan,
        bool rxFIFOMsg, uint8_t msgBufOrRxFIFONum,
        cy_stc_canfd_rx_buffer_t const *rxBuffer,
        cy_stc_canfd_context_t const *context)
{
    cy_en_canfd_status_t ret = CY_CANFD_BAD_PARAM;
    uint32_t address = 0UL;
    if (rxFIFOMsg)
    {
        /* Reading from the FIFO buffer */
        if (0U == msgBufOrRxFIFONum)
        {
            /* FIFO0 is used */
            if (_FLD2BOOL(CANFD_CH_RXFTOP_CTL_F0TPE, CANFD_RXFTOP_CTL(base, chan)))   /* The RxFifo Top pointer logic is used. */
            {
                /* Gets data from the FIFO top register. The Read address is incremented by HW */
                ret = Cy_CANFD_GetFIFOTop(base, chan, CY_CANFD_RX_FIFO0, rxBuffer);

            }
            else        /* The RxFifo Top pointer logic is not used */
            {
                address = Cy_CANFD_CalcRxFifoAdrs(base, chan,
                                                  CY_CANFD_RX_FIFO0,
                                                  _FLD2VAL(CANFD_CH_M_TTCAN_RXF0S_F0GI, CANFD_RXF0S(base, chan)),
                                                  context);

                if (0UL != address)
                {
                    /* Extracts the received message from the buffer */
                    ret = Cy_CANFD_GetRxBuffer(base, chan, address, rxBuffer);

                    /* Acknowledges the FIFO message */
                    CANFD_RXF0A(base, chan) = _CLR_SET_FLD32U(CANFD_RXF0A(base, chan),
                                              CANFD_CH_M_TTCAN_RXF0A_F0AI,
                                              _FLD2VAL(CANFD_CH_M_TTCAN_RXF0S_F0GI, CANFD_RXF0S(base, chan)));
                }
            }
        }
        else
        {
            /* FIFO1 is used */
            if (_FLD2BOOL(CANFD_CH_RXFTOP_CTL_F1TPE, CANFD_RXFTOP_CTL(base, chan)))  /* The RxFifo Top pointer logic is used. */
            {
                /* Gets data from the FIFO top register. The Read address is incremented by the HW */
                ret = Cy_CANFD_GetFIFOTop(base, chan, CY_CANFD_RX_FIFO1, rxBuffer);
            }
            else        /* The RxFifo Top pointer logic is not used */
            {
                address = Cy_CANFD_CalcRxFifoAdrs(base, chan,
                                                  CY_CANFD_RX_FIFO1,
                                                  _FLD2VAL(CANFD_CH_M_TTCAN_RXF1S_F1GI, CANFD_RXF1S(base, chan)),
                                                  context);

                if (0UL != address)
                {
                    ret = Cy_CANFD_GetRxBuffer(base, chan, address, rxBuffer);

                    /* Acknowledges the FIFO message */
                    CANFD_RXF1A(base, chan) = _CLR_SET_FLD32U(CANFD_RXF1A(base, chan),
                                              CANFD_CH_M_TTCAN_RXF1A_F1AI,
                                              _FLD2VAL(CANFD_CH_M_TTCAN_RXF1S_F1GI, CANFD_RXF1S(base, chan)));
                }
            }
        }
    }
    else
    {
        /* Reads from the dedicated RX buffer */
        address = Cy_CANFD_CalcRxBufAdrs(base, chan, msgBufOrRxFIFONum, context);

        if (0UL != address)
        {
            /* Extracts the received message from the buffer */
            ret = Cy_CANFD_GetRxBuffer(base, chan, address, rxBuffer);

            if (msgBufOrRxFIFONum < CY_CANFD_MESSAGE_HALF_OF_RX_BUFFERS)
            {
                /* Clears the NDAT1 register */
                CANFD_NDAT1(base, chan) = (1UL << (msgBufOrRxFIFONum));
            }
            else
            {
                /* Clears the NDAT2 register */
                CANFD_NDAT2(base, chan) = (1UL << (msgBufOrRxFIFONum - (CY_CANFD_MESSAGE_HALF_OF_RX_BUFFERS)));
            }
        }
    }

    return ret;
}


