PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_canfd.c
/*******************************************************************************
* Function Name: Cy_CANFD_AckRxBuf
****************************************************************************//**
*
*  Acknowledges the data reading and makes the buffer element available for
*  a next message.
*
* \param *base
* The pointer to a CAN FD instance.
*
* \param chan
*     The CAN FD channel number.
*
* \param bufNum
*    The RX buffer element index.
*
* \funcusage
* \snippet canfd/snippet/main.c snippet_Cy_CANFD_GetRxBuffer
*
*******************************************************************************/
void Cy_CANFD_AckRxBuf(CANFD_Type *base, uint32_t chan, uint32_t bufNum)
{
    CY_ASSERT_L2(CY_CANFD_IS_RX_BUF_NUM_VALID(bufNum));
    if (bufNum < CY_CANFD_MESSAGE_HALF_OF_RX_BUFFERS)
    {
        /* Clears the NDAT1 register */
        CANFD_NDAT1(base, chan) = (1UL << (bufNum));
    }
    else
    {
        /* Clears the NDAT2 register */
        CANFD_NDAT2(base, chan) = (1UL << (bufNum - (CY_CANFD_MESSAGE_HALF_OF_RX_BUFFERS)));
    }
}


/*******************************************************************************
* Function Name: Cy_CANFD_AckRxFifo
****************************************************************************//**
*
*  Acknowledges the data reading and makes the buffer element available for
*  a next message.
* \note Do not use this function with Cy_CANFD_GetFIFOTop(). FIFO top logic
*  takes care on updating the FIFO read pointer buffer with hardware.
*
* \param *base
* The pointer to a CAN FD instance.
*
* \param chan
*  The CAN FD channel number.
*
* \param FIFOnumber
*  The RX buffer element index.
*
* \funcusage
* \snippet canfd/snippet/main.c snippet_Cy_CANFD_GetRxBuffer
*
*******************************************************************************/
void Cy_CANFD_AckRxFifo(CANFD_Type *base, uint32_t chan, uint32_t FIFOnumber)
{
    switch (FIFOnumber)
    {
    case CY_CANFD_RX_FIFO0:
        /* Acknowledges the FIFO message */
        CANFD_RXF0A(base, chan) = _CLR_SET_FLD32U(CANFD_RXF0A(base, chan),
                                  CANFD_CH_M_TTCAN_RXF0A_F0AI,
                                  _FLD2VAL(CANFD_CH_M_TTCAN_RXF0S_F0GI, CANFD_RXF0S(base, chan)));
        break;
    case CY_CANFD_RX_FIFO1:
        /* Acknowledges the FIFO message */
        CANFD_RXF1A(base, chan) = _CLR_SET_FLD32U(CANFD_RXF1A(base, chan),
                                  CANFD_CH_M_TTCAN_RXF1A_F1AI,
                                  _FLD2VAL(CANFD_CH_M_TTCAN_RXF1S_F1GI, CANFD_RXF1S(base, chan)));
        break;
    default:
        /* Invalid FIFO number */
        break;
    }
}


/*******************************************************************************
* Function Name: Cy_CANFD_IrqHandler
****************************************************************************//**
*
*  CAN FD (Status/Error/Rx/Tx) interrupt ISR.
*
* \param *base
* The pointer to a CAN FD instance.
*
* \param chan
*     The CAN FD channel number.
*
* \param context
* The pointer to the context structure \ref cy_stc_canfd_context_t allocated
* by the user. The structure is used during the CAN FD operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
*******************************************************************************/
void Cy_CANFD_IrqHandler(CANFD_Type *base, uint32_t chan, cy_stc_canfd_context_t const *context)
{
    uint32_t           address = 0UL;
    uint32_t           messageBufferNumber;
    uint32_t           rxData[CY_CANFD_DATA_ELEMENTS_MAX];
    cy_stc_canfd_r0_t  r0RxBuffer;
    cy_stc_canfd_r1_t  r1RxBuffer;

    cy_stc_canfd_rx_buffer_t rxBuffer =
    {
        /* .r0_f         */ &r0RxBuffer,
        /* .r1_f         */ &r1RxBuffer,
        /* .data_area_f  */ rxData
    };

    /* Other than a Tx/Rx interrupt occurred */
    if (0UL != (Cy_CANFD_GetInterruptStatus(base, chan) & CY_CANFD_ERRORS_MASK))
    {
        /* Calls the callback function if it was set previously */
        if (NULL != context->canFDInterruptHandling.canFDErrorInterruptFunction)
        {
            context->canFDInterruptHandling.canFDErrorInterruptFunction(Cy_CANFD_GetInterruptStatus(base, chan));
        }
        else
        {
            uint32_t status = Cy_CANFD_GetInterruptStatus(base, chan) & CY_CANFD_ERRORS_MASK;
            Cy_CANFD_ClearInterrupt(base, chan, status);
        }
    }

    /* At least one received message must be stored into the Rx Buffer */
    if (CANFD_CH_M_TTCAN_IR_DRX_Msk == (Cy_CANFD_GetInterruptStatus(base, chan) & CANFD_CH_M_TTCAN_IR_DRX_Msk))
    {
        /* Clears the Message stored to the Dedicated Rx Buffer flag */
        Cy_CANFD_ClearInterrupt(base, chan, CANFD_CH_M_TTCAN_IR_DRX_Msk);

        if (0UL != CANFD_NDAT1(base, chan))       /* Message buffers 0-31 */
        {
            for (messageBufferNumber = 0UL;
                    messageBufferNumber < (CY_CANFD_MESSAGE_HALF_OF_RX_BUFFERS);
                    messageBufferNumber++)
            {
                if (0UL != (CANFD_NDAT1(base, chan) & (1UL << messageBufferNumber)))
                {
                    /* Calculates the Rx Buffer address */
                    address = Cy_CANFD_CalcRxBufAdrs(base, chan, messageBufferNumber, context);

                    /* Clears the NDAT1 register */
                    CANFD_NDAT1(base, chan) = (1UL << messageBufferNumber);

                    break;
                }
            }
        }
        else /* Message buffers 32-63 */
        {
            for (messageBufferNumber = CY_CANFD_MESSAGE_HALF_OF_RX_BUFFERS;
                    messageBufferNumber < (CY_CANFD_MESSAGE_HALF_OF_RX_BUFFERS + CY_CANFD_MESSAGE_HALF_OF_RX_BUFFERS);
                    messageBufferNumber++)
            {
                if (0UL != (CANFD_NDAT2(base, chan) & (1UL << (messageBufferNumber - CY_CANFD_MESSAGE_HALF_OF_RX_BUFFERS))))
                {
                    /* Calculates the Rx Buffer address */
                    address = Cy_CANFD_CalcRxBufAdrs(base, chan, messageBufferNumber, context);

                    /* Clears the NDAT2 register */
                    CANFD_NDAT2(base, chan) = (1UL << (messageBufferNumber - (CY_CANFD_MESSAGE_HALF_OF_RX_BUFFERS)));

                    break;
                }
            }
        }

        if (0UL != address)
        {
            /* Extracts the received message from a buffer */
            (void)Cy_CANFD_GetRxBuffer(base, chan, address, &rxBuffer);

            /* After a CAN FD message is received, checks if there is a callback function */
            /* Calls the callback function if it was set previously */
            if (NULL != context->canFDInterruptHandling.canFDRxInterruptFunction)
            {
                context->canFDInterruptHandling.canFDRxInterruptFunction(false, messageBufferNumber, &rxBuffer);
            }
        }
    }
    else if (CANFD_CH_M_TTCAN_IR_RF0N_Msk ==
             (Cy_CANFD_GetInterruptStatus(base, chan) & CANFD_CH_M_TTCAN_IR_RF0N_Msk)) /* New message stored into RxFIFO 0 */
    {
        /* Clears the new message interrupt flag */
        Cy_CANFD_ClearInterrupt(base, chan, CANFD_CH_M_TTCAN_IR_RF0N_Msk);

        while (_FLD2VAL(CANFD_CH_M_TTCAN_RXF0S_F0FL, CANFD_RXF0S(base, chan)) > 0UL)    /* Checks the Rx FIFO 0 fill level */
        {
            if (_FLD2BOOL(CANFD_CH_RXFTOP_CTL_F0TPE, CANFD_RXFTOP_CTL(base, chan)))   /* The RxFifo Top pointer logic is used */
            {
                /* Gets data from the FIFO top register. The Read address is incremented by HW */
                (void)Cy_CANFD_GetFIFOTop(base, chan, CY_CANFD_RX_FIFO0, &rxBuffer);

                /* After a CAN FD message is received, checks if there is a callback function */
                /* Calls the callback function if it was set previously */
                if (NULL != context->canFDInterruptHandling.canFDRxInterruptFunction)
                {
                    context->canFDInterruptHandling.canFDRxInterruptFunction(true, CY_CANFD_RX_FIFO0, &rxBuffer);
                }
            }
            else        /* The RxFifo Top pointer logic is not used */
            {
                address = Cy_CANFD_CalcRxFifoAdrs(base, chan,
                                                  CY_CANFD_RX_FIFO0,
                                                  _FLD2VAL(CANFD_CH_M_TTCAN_RXF0S_F0GI, CANFD_RXF0S(base, chan)),
                                                  context);

                if (0UL != address)
                {
                    /* Extracts the received message from a buffer */
                    (void)Cy_CANFD_GetRxBuffer(base, chan, address, &rxBuffer);

                    /* Acknowledges the FIFO message */
                    CANFD_RXF0A(base, chan) = _CLR_SET_FLD32U(CANFD_RXF0A(base, chan),
                                              CANFD_CH_M_TTCAN_RXF0A_F0AI,
                                              _FLD2VAL(CANFD_CH_M_TTCAN_RXF0S_F0GI, CANFD_RXF0S(base, chan)));

                    /* After a CAN FD message received, checks if there is a callback function */
                    /* Calls the callback function if it was set previously */
                    if (NULL != context->canFDInterruptHandling.canFDRxInterruptFunction)
                    {
                        context->canFDInterruptHandling.canFDRxInterruptFunction(true, CY_CANFD_RX_FIFO0, &rxBuffer);
                    }
                }
            }
        }
    }
    else if (CANFD_CH_M_TTCAN_IR_RF1N_Msk ==
             (Cy_CANFD_GetInterruptStatus(base, chan) & CANFD_CH_M_TTCAN_IR_RF1N_Msk)) /* New message stored into RxFIFO 1 */
    {
        /* Clears the new message interrupt flag */
        Cy_CANFD_ClearInterrupt(base, chan, CANFD_CH_M_TTCAN_IR_RF1N_Msk);
        while (_FLD2VAL(CANFD_CH_M_TTCAN_RXF1S_F1FL, CANFD_RXF1S(base, chan)) > 0UL) /* Checks the Rx FIFO 1 fill level */
        {
            if (_FLD2BOOL(CANFD_CH_RXFTOP_CTL_F1TPE, CANFD_RXFTOP_CTL(base, chan)))  /* The RxFifo Top pointer logic is used */
            {
                /* Gets data from the FIFO top register. The Read address is incremented by the HW */
                (void)Cy_CANFD_GetFIFOTop(base, chan, CY_CANFD_RX_FIFO1, &rxBuffer);

                /* After a CAN FD message is received, checks if there is a callback function */
                /* Calls the callback function if it was set previously */
                if (NULL != context->canFDInterruptHandling.canFDRxInterruptFunction)
                {
                    context->canFDInterruptHandling.canFDRxInterruptFunction(true,
                            CY_CANFD_RX_FIFO1,
                            &rxBuffer);
                }
            }
            else        /* The RxFifo Top pointer logic is not used */
            {
                address = Cy_CANFD_CalcRxFifoAdrs(base, chan,
                                                  CY_CANFD_RX_FIFO1,
                                                  _FLD2VAL(CANFD_CH_M_TTCAN_RXF1S_F1GI, CANFD_RXF1S(base, chan)),
                                                  context);

                if (0UL != address)
                {
                    (void)Cy_CANFD_GetRxBuffer(base, chan, address, &rxBuffer);

                    /* Acknowledges the FIFO message */
                    CANFD_RXF1A(base, chan) = _CLR_SET_FLD32U(CANFD_RXF1A(base, chan),
                                              CANFD_CH_M_TTCAN_RXF1A_F1AI,
                                              _FLD2VAL(CANFD_CH_M_TTCAN_RXF1S_F1GI, CANFD_RXF1S(base, chan)));

                    /* After a CAN FD message is received, checks if there is a callback function */
                    /* Calls the callback function if it was set previously */
                    if (NULL != context->canFDInterruptHandling.canFDRxInterruptFunction)
                    {
                        context->canFDInterruptHandling.canFDRxInterruptFunction(true,
                                CY_CANFD_RX_FIFO1,
                                &rxBuffer);
                    }
                }
            }
        }
    }
    else if (CANFD_CH_M_TTCAN_IR_TC_Msk ==
             (Cy_CANFD_GetInterruptStatus(base, chan) & CANFD_CH_M_TTCAN_IR_TC_Msk)) /* Transmission Completed */
    {
        /* The CAN FD message is successfully transmitted */
        /* Clears the Transmission completed flag */
        Cy_CANFD_ClearInterrupt(base, chan, CANFD_CH_M_TTCAN_IR_TC_Msk);

        /* Calls the callback function if it was set previously */
        if (NULL != context->canFDInterruptHandling.canFDTxInterruptFunction)
        {
            context->canFDInterruptHandling.canFDTxInterruptFunction();
        }
    }
    else
    {
        /* An unused event occurs. Skip it */
    }
}


