PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_canfd.c
    CY_ASSERT_L2(CY_CANFD_IS_MESSAGE_BUFFER_IDX_VALID(index));

    /* Checks whether the CAN FD controller is not in the INIT state and Tx buffer is empty or not */
    if (!((_FLD2BOOL(CANFD_CH_M_TTCAN_CCCR_INIT, CANFD_CCCR(base, chan))) ||
            (0UL != (CANFD_TXBRP(base, chan) & (1UL << index)))))
    {
        CANFD_TXBAR(base, chan) = 1UL << index; /* Transmits the buffer add request */

        ret = CY_CANFD_SUCCESS;
    }
    return ret;
}


/*******************************************************************************
* Function Name: Cy_CANFD_UpdateAndTransmitMsgBuffer
****************************************************************************//**
*
* Updates the T0 and T1 Tx buffer element parameters in Message RAM and copies
* data from cy_stc_canfd_tx_buffer_t structure to Message RAM.
* Transmits the message immediately.
* Function CanFD_Init() must be called before setting up the identifier and enabling
* this message buffer.
*
* \param *base
* The pointer to a CAN FD instance.
*
* \param chan
* The CAN FD channel number.
*
* \param *txBuffer
* The Tx Buffer configuration structure.
*
* \param index
* the message buffer index (0-31).
*
* \param context
* The pointer to the context structure \ref cy_stc_canfd_context_t allocated
* by the user. The structure is used during the CAN FD operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return \ref cy_en_canfd_status_t
*
* \funcusage
* \snippet canfd/snippet/main.c snippet_Cy_CANFD_UpdateAndTransmitMsgBuffer
*
*******************************************************************************/
cy_en_canfd_status_t Cy_CANFD_UpdateAndTransmitMsgBuffer(CANFD_Type *base, uint32_t chan,
        const cy_stc_canfd_tx_buffer_t *txBuffer,
        uint8_t index,
        cy_stc_canfd_context_t const *context)
{
    cy_en_canfd_status_t ret = CY_CANFD_BAD_PARAM;

    ret = Cy_CANFD_TxBufferConfig(base, chan, txBuffer, index, context);

    if (CY_CANFD_SUCCESS == ret)
    {
        ret = Cy_CANFD_TransmitTxBuffer(base, chan, index);
    }
    return ret;
}


/*******************************************************************************
* Function Name: Cy_CANFD_GetTxBufferStatus
****************************************************************************//**
*
*  Gets the status of the CAN FD Tx buffer.
*
* \param *base
* The pointer to a CAN FD instance.
*
* \param chan
* The CAN FD channel number.
*
* \param index
* Message buffer index (0-31).
*
* \return \ref cy_en_canfd_status_t
*
* \funcusage
* \snippet canfd/snippet/main.c snippet_Cy_CANFD_GetTxBufferStatus
*
*******************************************************************************/
cy_en_canfd_tx_buffer_status_t Cy_CANFD_GetTxBufferStatus(CANFD_Type const *base, uint32_t chan, uint8_t index)
{
    cy_en_canfd_tx_buffer_status_t enTxBufferStatus;

    CY_ASSERT_L2(CY_CANFD_IS_MESSAGE_BUFFER_IDX_VALID(index));

    /* Initializes return value */
    enTxBufferStatus = CY_CANFD_TX_BUFFER_IDLE;

    if (0UL != (CANFD_TXBRP(base, chan) & (1UL << index)))   /* Pending transmission request */
    {
        /* Checks if the cancel request was issued */
        if (0UL == (CANFD_TXBCR(base, chan) & (1UL << index)))
        {
            /* No cancellation request */
            enTxBufferStatus = CY_CANFD_TX_BUFFER_PENDING;
        }
        else
        {
            /* Cancel request issued */
            enTxBufferStatus = CY_CANFD_TX_BUFFER_CANCEL_REQUESTED;
        }
    }
    else if (0UL != (CANFD_TXBTO(base, chan) & (1UL << index))) /* Transmission occurred */
    {
        enTxBufferStatus = CY_CANFD_TX_BUFFER_TRANSMIT_OCCURRED;
    }
    else if (0UL != (CANFD_TXBCF(base, chan) & (1UL << index))) /* Cancellation finished */
    {
        enTxBufferStatus = CY_CANFD_TX_BUFFER_CANCEL_FINISHED;
    }
    else
    {
        /* Closing if-else-if sequence */
    }

    return enTxBufferStatus;
}

#if defined(__cplusplus)
}
#endif

#endif /* CY_IP_MXTTCANFD */


/* [] END OF FILE */
